//카운트 다운 50000부터 0까지
var n = 50000; //시작값 (제어변수: 시작갑승ㄹ 저장하는 변수)------------------\

while (n >= 0) { //끝값 (조건식: 반복문의 끝을 결정)-------------------------ㅡ 반복문의 3요소
    console.log(`${n}!!`);
    --n; //증감값 (step: 반복문의 조건식이 언젠가 false가 될수 있도록 조정)----/
}

console.log(`반복문 끝! n은 ${n}`);


console.log(`===================================`);

var level = 5;

//n은 1부터 9까지 1씩 증가하면서 반복
var n = 1;

while (n <= 9) {
    console.log(`${level} x ${n} = ${level * n}`);
    n += 0.1;
}

console.log(`===================================`);
var m = 1;

while (m <= 100) {
    if (m % 2 === 1) {
        console.log(m);
    }
    m++
}
console.log(`|\\_/|\n|q p|   /}\n( 0 )"""\\\n|"^"\`    |\n||_/=\\\\__|\n`);